<?php
    echo 'Всем ', 'привет ', 'от ', 'PHP!<br><br>';
    //Для вывода слов на разных строках мы используем элемент "br", т.е разрыв строки
    //Переменные выводимые оператором echo перечисляются через запятую
    echo 'Всем<br>', 'привет<br>', 'от<br>', 'PHP!';
    /*После каждой инструкции мы будем ставить точку с запятой даже, если инструкция является последней в блоке php-кода!*/

    $a = 5;
    echo '<br>a = '.$a;

    $b = 10;
    echo '<br>b = '.$b;

    echo '<br>a + b = ', $a + $b;
    echo '<br>a - b = ', $a - $b;
    echo '<br>a * b = ', $a * $b;
    echo '<br>a / b = ', $a / $b;

    $c = $a + $b;
    echo '<br>c = ', $c;

    $c = $c + $b;
    echo '<br>c = ', $c;

    $c = 2 * $c;
    echo '<br>c = ', $c;

    /* Присвоение переменной по значению. После каждой операции старайтесь
    смотреть результат в браузере, используя для вывода оператор echo */

    //Присвоили переменной $a число 15
    $a = 15;
    echo "<br>a = ", $a;
    //Присвоили переменной $b переменную $a, теперь $b==$a==15
    $b = $a;
    echo "<br>b = ", $b;
    //Изменили значение переменной $b на 'new', при этом
    //значение переменной $a не изменилось ($a==15)
    $b = 'new';
    echo "<br>b = ", $b;
    //Опять присвоили переменной $b переменную $a, теперь $b==15
    $b = $a;
    echo "<br>b = ", $b;
    //Изменили значение переменной $a на 'sos', при этом
    //значение переменной $b не изменилось ($b==15)
    $a = 'sos';
    echo "<br>a = ", $a;
    /* Таким образом, переменная, присвоенная по значению, не зависит от
    переменной, которой она была присвоена */

    /* Присвоение переменной по ссылке. После каждой операции старайтесь
    смотреть результат в браузере, используя для вывода оператор echo */

    //Инициализировали переменную $c присвоив ей значение 10
    $c = 10;
    echo "</br>",$c;
    //Присвоили по ссылке переменной $b переменную $c,
    //теперь $b==$c==5.
    $b = &$c;
    echo "</br>",$b;
    //Изменили значение переменной $b на 'new_2', теперь
    //$b=='new_2' и $c также равна 'new_2'
    $b = 'new_2';
    echo "</br>",$c;
    echo "</br>",$b;
    //Изменили значение переменной $c на число 20, теперь
    //$c==20 и $b также изменилась ($b==20)
    $c = 20;
    echo "</br>",$c;
    echo "</br>",$b;
    /* Таким образом, можно сказать, что переменная, присвоенная по ссылке,
    просто является псевдонимом переменной, которой она была присвоена */

    $a = 10;
    echo "</br>",$a;
    $b = 20;
    echo "</br>",$b;
    $car = 'a';
    echo "</br>",$car;
    $track = 'b';
    echo "</br>",$track;
    echo "</br>",${$car};
    echo "</br>",${$track};

    $n = 'number';
    echo "<br/>$n";

    $a='Добро ';
    $b='побеждает ';
    $c='зло ';
    $d=$a.$b.$c;         

    echo $d, '<br>';
